import numpy as np

# Ініціалізація розміру матриць
rows = 9
cols = 9

# Заповнення першої матриці випадковими цілими числами від 1 до 10
matrix1 = np.random.randint(1, 11, size=(rows, cols))

# Заповнення другої матриці випадковими цілими числами від 1 до 10
matrix2 = np.random.randint(1, 11, size=(rows, cols))

# Виведення обох матриць
print("Перша матриця:")
print(matrix1)
print("Друга матриця:")
print(matrix2)

# Знаходження відношення елементів другої матриці до першої (поелементне ділення)
result = np.divide(matrix2, matrix1)

# Виведення результату
print("Відношення елементів другої матриці до першої (поелементне ділення):")
print(result)
